20250603T215644--kdoc-383-javascriptはブラウザの組み込み言語でありランタイムの更新は難しい__permanent.org
:properties:
:ID: 20250603T215644
:mtime:    20250616195511
:ctime:    20250603215644
:end:
#+title:      KDOC 383: JavaScriptはブラウザの組み込み言語でありランタイムの更新は難しい
#+date:       [2025-06-03 Tue 21:56]
#+filetags:   :permanent:
#+identifier: 20250603T215644

* この文書のステータス
- 作成
  - [X] 2025-06-11 貴島
- レビュー
  - [X] 2025-06-16 貴島

* 概要

JavaScriptはブラウザの組み込み言語であるため、サーバーアプリケーションのようにランタイムをアプリケーションに合わせて維持したり更新できない。そのため、拡張した機能や文法を使いつつJavaScriptに変換することでランタイムを変更することなく追加機能の恩恵を受けるということをしている。

* 関連

- [[id:20250612T231654][KDOC 388: 『仕事ですぐに使えるTypeScript』]]4ページの内容から
- [[id:20250603T215521][KDOC 382: JavaScriptにトランスパイルするのはなぜか?]]。疑問に対する答え
