20250603T215644--kdoc-383-javascriptはブラウザの組み込み言語でありランタイムの更新は難しい__permanent.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-20T22:05:58Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 383: JavaScriptはブラウザの組み込み言語でありランタイムの更新は難しい</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 383: JavaScriptはブラウザの組み込み言語でありランタイムの更新は難しい</h1>
<div id="outline-container-org9dabed6" class="outline-2">
<h2 id="org9dabed6"><a href="#org9dabed6">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org9dabed6">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-06-11 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-06-16 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orge7436cd" class="outline-2">
<h2 id="orge7436cd"><a href="#orge7436cd">概要</a></h2>
<div class="outline-text-2" id="text-orge7436cd">
<p>
JavaScriptはブラウザの組み込み言語であるため、サーバーアプリケーションのようにランタイムをアプリケーションに合わせて維持したり更新できない。そのため、拡張した機能や文法を使いつつJavaScriptに変換することでランタイムを変更することなく追加機能の恩恵を受けるということをしている。
</p>
</div>
</div>
<div id="outline-container-org52dc795" class="outline-2">
<h2 id="org52dc795"><a href="#org52dc795">関連</a></h2>
<div class="outline-text-2" id="text-org52dc795">
<ul class="org-ul">
<li><a href="20250612T231654--kdoc-388-『仕事ですぐに使えるtypescript』__draft_book.html#ID-20250612T231654">KDOC 388: 『仕事ですぐに使えるTypeScript』</a>4ページの内容から</li>
<li><a href="20250603T215521--kdoc-382-javascriptにトランスパイルするのはなぜか__permanent.html#ID-20250603T215521">KDOC 382: JavaScriptにトランスパイルするのはなぜか?</a>。疑問に対する答え</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
